Revit 2026 API

# ModelPathCompare Method

---

Compares this ModelPath with another

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int Compare(
	ModelPath otherPath
)
```
```vb
Public Function Compare (
	otherPath As ModelPath
) As Integer
```
```cpp
public:
int Compare(
	ModelPath^ otherPath
)
```
```fsharp
member Compare :
        otherPath : ModelPath -> int
```

#### Parameters

otherPath ModelPath
     The path to compare against.

#### Return Value

Int32 A signed integer indicating the lexical relationship between two ModelPaths. Value is less than zero if this path is less than the given path; zero if the two are the same; and more than zero otherwise

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The comparison is case-insensitive.

#### Reference

ModelPath Class

Autodesk.Revit.DB Namespace